#This file must be generated by some pareto optimization script
set filename results/DLX_8ns_minpower.ddc

read_file -format ddc $filename
#Export the file to a verilog file for floorplan
ungroup -flatten -all
change_names -rules verilog
write_file -format verilog -output DLX.v
